
create table tbl_DistrictList
(
DId                int not null identity(1,1) primary key,	
OrderNo             int not null,
Code                nvarchar(254),
DistrictName          nvarchar(254),
ProvinceName          nvarchar(254),
Status              bit not null,

CreateBy             int not null constraint fk_DistrictList_CreateBy foreign key references tbl_User(UserId),
ModifyBy                 int null constraint fk_DistrictList_ModifyBy foreign key references tbl_User(UserId),
UpdateLogDateTime        datetime,
LogDateTime              datetime not null default current_timestamp
)
 
GO




INSERT INTO tbl_DistrictList (Code, DistrictName, ProvinceName , Status , CreateBy, UpdateLogDateTime)
VALUES 
(1, 'DS001' , N'ताप्लेजुङ', N'प्रदेश नं. १',1, 1, GETDATE()),
(2, 'DS002' , N'पाँचथर', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(3, 'DS003' , N'इलाम', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(4, 'DS004' , N'संखुवासभा', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(5, 'DS005' , N'तेह्रथुम', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(6, 'DS006' , N'धनकुटा', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(7, 'DS007' , N'भोजपुर', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(8, 'DS008' , N'खोटाङ', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(9, 'DS009' , N'सोलुखुम्बु', N'प्रदेश नं. १', 1 , 1, GETDATE()),

(10, 'DS010' , N'ओखलढुङ्गा', N'प्रदेश नं. १',1, 1, GETDATE()),
(11, 'DS011' , N'उदयपुर', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(12, 'DS012' , N'झापा', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(13, 'DS013' , N'मोरङ', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(14, 'DS014' , N'सुनसरी', N'प्रदेश नं. १', 1 , 1, GETDATE()),
(15, 'DS015' , N'सप्तरी', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(16, 'DS016' , N'सिराहा', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(17, 'DS017' , N'धनुषा', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(18, 'DS018' , N'महोतरी', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(19, 'DS019' , N'सर्लाही', N'प्रदेश नं. २', 1 , 1, GETDATE()),


(20, 'DS020' , N'रौतहट', N'प्रदेश नं. २',1, 1, GETDATE()),
(21, 'DS021' , N'बारा', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(22, 'DS022' , N'पर्सा', N'प्रदेश नं. २', 1 , 1, GETDATE()),
(23, 'DS023' , N'दोलखा', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(24, 'DS024' , N'रामेछाप', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(25, 'DS025' , N'सिन्धुली', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(26, 'DS026' , N'काभ्रेपलाञ्चोक', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(27, 'DS027' , N'सिन्धुपाल्चोक', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(28, 'DS028' , N'रसुवा', N'बागमती प्रदेश', 1 , 1, GETDATE()),
(29, 'DS029' , N'नुवाकोट', N'बागमती प्रदेश', 1 , 1, GETDATE()),


(30, 'DS030' , N'धादिङ' , N'बागमती प्रदेश', 1, 1, GETDATE()),
(31, 'DS031' , N'चितवन' , N'बागमती प्रदेश', 1 , 1, GETDATE()),
(32, 'DS032' , N'मकवानपुर' , N'बागमती प्रदेश', 1 , 1, GETDATE()),
(33, 'DS033' , N'भक्तपुर' , N'बागमती प्रदेश', 1 , 1, GETDATE()),
(34, 'DS034' , N'ललितपुर' , N'बागमती प्रदेश', 1 , 1, GETDATE()),
(35, 'DS035' , N'काठमाडौं' , N'बागमती प्रदेश', 1 , 1, GETDATE()),
(36, 'DS036' , N'गोरखा' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(37, 'DS037' , N'लम्जुङ' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(38, 'DS038' , N'तनहुँ' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(39, 'DS039' , N'कास्की' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),


(40, 'DS040' , N'मनाङ' , N'गण्डकी प्रदेश', 1, 1, GETDATE()),
(41, 'DS041' , N'मुस्ताङ' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(42, 'DS042' , N'पर्वत' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(43, 'DS043' , N'स्याङ्जा' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(44, 'DS044' , N'म्याग्दी' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(45, 'DS045' , N'बागलुङ' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(46, 'DS046' , N'नवलपरासी (बर्दघाट सुस्ता पूर्व)' , N'गण्डकी प्रदेश', 1 , 1, GETDATE()),
(47, 'DS047' , N'नवलपरासी (बर्दघाट-सुस्ता पश्चिम)' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(48, 'DS048' , N'रूपन्देहि' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(49, 'DS049' , N'कपिलवस्तु' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),


(50, 'DS050' , N'पाल्पा' , N'लुम्बिनी प्रदेश', 1, 1, GETDATE()),
(51, 'DS051' , N'अर्घाखाँची' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(52, 'DS052' , N'गुल्मी' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(53, 'DS053' , N'रुकुम (पूर्वी भाग)' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(54, 'DS054' , N'रोल्पा' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(55, 'DS055' , N'प्युठान' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(56, 'DS056' , N'दाङ देउखुरी' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(57, 'DS057' , N'बाँके' , N'लुम्बिनी प्रदेश', 1 , 1, GETDATE()),
(58, 'DS058' , N'रुकुम (पश्चिम भाग)' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(59, 'DS059' , N'सल्यान' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),


(60, 'DS060' , N'डोल्पा' , N'कर्णाली प्रदेश', 1, 1, GETDATE()),
(61, 'DS061' , N'जुम्ला' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(62, 'DS062' , N'मुगु' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(63, 'DS063' , N'हुम्ला' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(64, 'DS064' , N'कालिकोट' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(65, 'DS065' , N'जाजरकोट' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(66, 'DS066' , N'दैलेख' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(67, 'DS067' , N'सुर्खेत' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(68, 'DS068' , N'सल्यान' , N'कर्णाली प्रदेश', 1 , 1, GETDATE()),
(69, 'DS069' , N'बाजुरा' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),


(70, 'DS070' , N'बझाङ' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(71, 'DS071' , N'डोटी' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(72, 'DS072' , N'अछाम' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(73, 'DS073' , N'दार्चुला' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(74, 'DS074' , N'बैतडी' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(75, 'DS075' , N'डडेल्धुरा' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(76, 'DS076' , N'कञ्चनपुर' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE()),
(77, 'DS077' , N'कैलाली' , N'सुदुर पश्चिम प्रदेश', 1 , 1, GETDATE());
GO
